Revit 2027 API
PropertySelectionType Enumeration
 An enumerated type listing the types of properties to find in the template.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PropertySelectionType
Public Enumeration PropertySelectionType
public enum class PropertySelectionType
type PropertySelectionType
Members
Member name | Value | Description
All | 0 |  All the properties.
Exporting | 1 |  The properties that are included in export.
NonExporting | 2 |  The properties that are not included in export.
See Also
Reference
Autodesk.Revit.DB Namespace